cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Driver/FDCAN_STM32H7xx.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2017-2023 Arm Limited (or its affiliates).
 * All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 *
 * $Date:        27. February 2023
 * $Revision:    V1.4
 *
 * Driver:       Driver_CAN1/2
 *
 * Configured:   via CubeMX
 * Project:      CAN1/2 Driver for FDCAN 1/2 of ST STM32H7xx
 * -------------------------------------------------------------------------- */

/*! \page stm32h7_can CAN

# Revision History

- Version 1.4
  - Updated function CANx_GetStatus (solved potential LTO problem)
- Version 1.3
  - Updated __MEMORY_AT macro
- Version 1.2
  - Corrected CAN SRAM read/write to 4 byte accesses
- Version 1.1
  - Changed FDCAN_ECR_TREC_.. to FDCAN_ECR_REC_.. to align with updated device header
  - Corrected SetBitrate function
- Version 1.0
  - Initial release

# Capabilities

This driver supports **Master** mode.

# Instances

Hardware resource relating to driver instance is shown in the table below:

Driver Instance     | Hardware Resource
:-------------------|:-----------------:
Driver_CAN1         | FDCAN1
Driver_CAN2         | FDCAN2

# Limitations

Driver limitations:
 - TTCAN is not supported
 - Tx FIFO and Tx Buffers transmit concepts are used (Tx Queue is not used)
 - Only interrupt 0 line is used

# Configuration

## Compile-time

Definitions used for compile-time configuration of this driver are shown in the table below:

Definition                         | Default value | Max Value | Description
:----------------------------------|:-------------:|:---------:|:-----------
CAN_CLOCK_TOLERANCE                | **15**        | 1024      | clock tolerance in 1/n steps
CAN_NON_ISO_EN                     | **0**         |    0      | non-ISO CAN FD mode disabled
^                                  | ^             |    1      | non-ISO CAN FD mode enabled
CAN1_RX_FIFO0_ELEM_NUM             | **8**         |   64      | number of receive FIFO0 elements
CAN1_RX_FIFO1_ELEM_NUM             | **8**         |   64      | number of receive FIFO1 elements
CAN1_TX_FIFO_ELEM_NUM              | **8**         |   32      | number of transmit FIFO elements
CAN1_RX_BUF_NUM                    | **16**        |   64      | maximum number of receive buffers
CAN1_TX_BUF_NUM                    | **16**        |   32      | maximum number of transmit buffers
CAN1_FILTER_STD_NUM                | **128**       |  128      | maximum number of standard elements
CAN1_FILTER_EXT_NUM                | **64**        |   64      | maximum number of extended elements
CAN2_RX_FIFO0_ELEM_NUM             | **8**         |   64      | number of receive FIFO0 elements
CAN2_RX_FIFO1_ELEM_NUM             | **8**         |   64      | number of receive FIFO1 elements
CAN2_TX_FIFO_ELEM_NUM              | **8**         |   32      | number of transmit FIFO elements
CAN2_RX_BUF_NUM                    | **16**        |   64      | maximum number of receive buffers
CAN2_TX_BUF_NUM                    | **16**        |   32      | maximum number of transmit buffers
CAN2_FILTER_STD_NUM                | **128**       |  128      | maximum number of standard elements
CAN2_FILTER_EXT_NUM                | **64**        |   64      | maximum number of extended elements

## STM32CubeMX

The CAN driver requires:
  - **FDCAN peripheral clock**
  - **FDCAN** peripheral Mode **Activated**
  - **FDCAN TX** and **Rx pins**

# STM32H743I-EVAL Board Configuration

These settings are relevant for this board, for different board please refer to the board
schematic for proper configuration.

Link to [STM32H743I-EVAL board schematic](https://www.st.com/resource/en/schematic_pack/mb1246-h743-e03_schematic.pdf).

## STM32CubeMX

Required peripherals for the **STM32H743I-EVAL** board are listed in the table below:

Peripheral | Mode                         | Description
:---------:|:----------------------------:|:-----------
FDCAN1     | Activated                    | FDCAN1 Controller
PA11       | Alternate Function Push Pull | FDCAN1_RX Pin
PA12       | Alternate Function Push Pull | FDCAN1_TX Pin

\note All settings have to be configured as described in the procedure below. Important settings,
      typically the ones different from default, are emphasized in **bold**.

### Pinout & Configuration tab

  1. In the **Pinout view** window click on a pin and select it's functionality:
        Pin      | Functionality
        :--------|:-------------:
        PA11     | **FDCAN1_RX**
        PA12     | **FDCAN1_TX**
       \n

  2. Under **Categories**: **Connectivity** select **FDCAN1**:

     __Mode__:
       - Activated: **checked**

     __Configuration__:
       - Parameter Settings: not used
       - User Constants: not used
       - NVIC Settings: configured in later step (under Category: System Core: NVIC)
       - GPIO Settings:
            Pin Name | Signal on Pin | Pin Context..| GPIO output..| GPIO mode                     | GPIO Pull-up/Pull..| Maximum out..| Fast Mode | User Label
            :--------|:-------------:|:------------:|:------------:|:-----------------------------:|:------------------:|:------------:|:---------:|:----------:
            PA11     | FDCAN1_RX     | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **Medium**   | n/a       | .
            PA12     | FDCAN1_TX     | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **Medium**   | n/a       | .

