cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Driver/FDCAN_STM32H7xx.c
// CAN message RAM base
#define CAN_RAM_BASE                    (0x4000AC00)

// Macro for absolute  ZI-memory positioning
#ifndef      __MEMORY_AT
  #if     (defined (__CC_ARM))
    #define  __MEMORY_AT(x)     __attribute__((at(x)))
  #elif   (defined (__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050))
    #define  __MEMORY_AT__(x)   __attribute__((section(".bss.ARM.__at_"#x)))
    #define  __MEMORY_AT(x)     __MEMORY_AT__(x)
  #else
    #define  __MEMORY_AT(x)
    #warning Position memory containing __MEMORY_AT macro at absolute address!
  #endif
#endif


#if   (CAN1_USED == 1)
extern FDCAN_HandleTypeDef hfdcan1;
#endif
#if   (CAN2_USED == 1)
extern FDCAN_HandleTypeDef hfdcan2;
#endif


// CAN Driver ******************************************************************

#define ARM_CAN_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1,4) // CAN driver version

// Driver Version
static const ARM_DRIVER_VERSION can_driver_version = { ARM_CAN_API_VERSION, ARM_CAN_DRV_VERSION };

// Driver Capabilities
static const ARM_CAN_CAPABILITIES can_driver_capabilities[2] = {
#if (CAN1_USED == 1)
  {                             // CAN1 driver capabilities
    CAN1_TOT_OBJ_NUM,           // Number of CAN Objects available
    1U,                         // Supports reentrant calls to ARM_CAN_MessageSend, ARM_CAN_MessageRead, ARM_CAN_ObjectConfigure and abort message sending used by ARM_CAN_Control.
    1U,                         // Supports CAN with flexible data-rate mode (CAN_FD)
    1U,                         // Supports restricted operation mode
    1U,                         // Supports bus monitoring mode
    1U,                         // Supports internal loopback mode
    1U                          // Supports external loopback mode
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  },
#else
  { 0U, 0U, 0U, 0U, 0U, 0U, 0U
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  },
#endif
#if (CAN2_USED == 1)
  {                             // CAN2 driver capabilities
    CAN2_TOT_OBJ_NUM,           // Number of CAN Objects available
    1U,                         // Supports reentrant calls to ARM_CAN_MessageSend, ARM_CAN_MessageRead, ARM_CAN_ObjectConfigure and abort message sending used by ARM_CAN_Control.
    1U,                         // Supports CAN with flexible data-rate mode (CAN_FD)
    1U,                         // Supports restricted operation mode
    1U,                         // Supports bus monitoring mode
    1U,                         // Supports internal loopback mode
    1U                          // Supports external loopback mode
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  }
#else
  { 0U, 0U, 0U, 0U, 0U, 0U, 0U
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  }
#endif
};

// Object Capabilities
static const ARM_CAN_OBJ_CAPABILITIES can_object_capabilities_rx_fifo0[2] = {
#if (CAN1_USED == 1)
  {                             // CAN1 Rx FIFO0 object capabilities
    0U,                         // Object does not support transmission
    1U,                         // Object supports reception
    0U,                         // Object does not support RTR reception and automatic Data transmission
    0U,                         // Object does not support RTR transmission and automatic Data reception
    1U,                         // Object allows assignment of multiple filters to it
    1U,                         // Object supports exact identifier filtering
    1U,                         // Object supports range identifier filtering
    1U,                         // Object supports mask identifier filtering
    CAN1_RX_FIFO0_ELEM_NUM      // Object can buffer CAN1_RX_FIFO0_ELEM_NUM configured number of messages
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  },
#else
  { 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  },
#endif
#if (CAN2_USED == 1)
  {                             // CAN2 Rx FIFO0 object capabilities
    0U,                         // Object does not support transmission
    1U,                         // Object supports reception
    0U,                         // Object does not support RTR reception and automatic Data transmission
    0U,                         // Object does not support RTR transmission and automatic Data reception
    1U,                         // Object allows assignment of multiple filters to it
    1U,                         // Object supports exact identifier filtering
    1U,                         // Object supports range identifier filtering
    1U,                         // Object supports mask identifier filtering
    CAN2_RX_FIFO0_ELEM_NUM      // Object can buffer CAN2_RX_FIFO0_ELEM_NUM configured number of messages
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  }
#else
  { 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  }
#endif
};
static const ARM_CAN_OBJ_CAPABILITIES can_object_capabilities_rx_fifo1[2] = {
#if (CAN1_USED == 1)
  {                             // CAN1 Rx FIFO1 object capabilities
    0U,                         // Object does not support transmission
    1U,                         // Object supports reception
    0U,                         // Object does not support RTR reception and automatic Data transmission
    0U,                         // Object does not support RTR transmission and automatic Data reception
    1U,                         // Object allows assignment of multiple filters to it
    1U,                         // Object supports exact identifier filtering
    1U,                         // Object supports range identifier filtering
    1U,                         // Object supports mask identifier filtering
    CAN1_RX_FIFO1_ELEM_NUM      // Object can buffer CAN1_RX_FIFO1_ELEM_NUM configured number of messages
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  },
#else
  { 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  },
#endif
#if (CAN2_USED == 1)
  {                             // CAN2 Rx FIFO1 object capabilities
    0U,                         // Object does not support transmission
    1U,                         // Object supports reception
    0U,                         // Object does not support RTR reception and automatic Data transmission
    0U,                         // Object does not support RTR transmission and automatic Data reception
    1U,                         // Object allows assignment of multiple filters to it
    1U,                         // Object supports exact identifier filtering
    1U,                         // Object supports range identifier filtering
    1U,                         // Object supports mask identifier filtering
    CAN2_RX_FIFO1_ELEM_NUM      // Object can buffer CAN2_RX_FIFO1_ELEM_NUM configured number of messages
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  }
#else
  { 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  }
#endif
};
static const ARM_CAN_OBJ_CAPABILITIES can_object_capabilities_rx_buffer[2] = {
#if (CAN1_USED == 1)
  {                             // CAN1 Rx Buffer object capabilities
    0U,                         // Object does not support transmission
    1U,                         // Object supports reception
    0U,                         // Object does not support RTR reception and automatic Data transmission
    0U,                         // Object does not support RTR transmission and automatic Data reception
    1U,                         // Object allows assignment of multiple filters to it
    1U,                         // Object supports exact identifier filtering
    0U,                         // Object does not support range identifier filtering
    0U,                         // Object does not support mask identifier filtering
    1U                          // Object can buffer 1 messages
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  },
#else
  { 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  },
#endif
#if (CAN2_USED == 1)
  {                             // CAN2 Rx Buffer object capabilities
    0U,                         // Object does not support transmission
    1U,                         // Object supports reception
    0U,                         // Object does not support RTR reception and automatic Data transmission
    0U,                         // Object does not support RTR transmission and automatic Data reception
    1U,                         // Object allows assignment of multiple filters to it
    1U,                         // Object supports exact identifier filtering
    0U,                         // Object does not support range identifier filtering
    0U,                         // Object does not support mask identifier filtering
    1U                          // Object can buffer 1 messages
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  }
#else
  { 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  }
#endif
};
