cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Driver/FDCAN_STM32H7xx.c
static const ARM_CAN_OBJ_CAPABILITIES can_object_capabilities_tx_fifo[2] = {
#if (CAN1_USED == 1)
  {                             // CAN1 Tx FIFO object capabilities
    1U,                         // Object supports transmission
    0U,                         // Object does not support reception
    0U,                         // Object does not support RTR reception and automatic Data transmission
    0U,                         // Object does not support RTR transmission and automatic Data reception
    0U,                         // Object does not allow assignment of multiple filters to it
    0U,                         // Object does not support exact identifier filtering
    0U,                         // Object does not support range identifier filtering
    0U,                         // Object does not support mask identifier filtering
    CAN1_TX_FIFO_ELEM_NUM       // Object can buffer CAN1_TX_FIFO_ELEM_NUM configured number of messages
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  },
#else
  { 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  },
#endif
#if (CAN2_USED == 1)
  {                             // CAN2 Tx FIFO object capabilities
    1U,                         // Object supports transmission
    0U,                         // Object does not support reception
    0U,                         // Object does not support RTR reception and automatic Data transmission
    0U,                         // Object does not support RTR transmission and automatic Data reception
    0U,                         // Object does not allow assignment of multiple filters to it
    0U,                         // Object does not support exact identifier filtering
    0U,                         // Object does not support range identifier filtering
    0U,                         // Object does not support mask identifier filtering
    CAN2_TX_FIFO_ELEM_NUM       // Object can buffer CAN2_TX_FIFO_ELEM_NUM configured number of messages
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  },
#else
  { 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  }
#endif
};
static const ARM_CAN_OBJ_CAPABILITIES can_object_capabilities_tx_buffer[2] = {
#if (CAN1_USED == 1)
  {                             // CAN1 Tx Buffer object capabilities
    1U,                         // Object supports transmission
    0U,                         // Object does not support reception
    0U,                         // Object does not support RTR reception and automatic Data transmission
    0U,                         // Object does not support RTR transmission and automatic Data reception
    0U,                         // Object does not allow assignment of multiple filters to it
    0U,                         // Object does not support exact identifier filtering
    0U,                         // Object does not support range identifier filtering
    0U,                         // Object does not support mask identifier filtering
    1U                          // Object can buffer 1 message
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  },
#else
  { 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  },
#endif
#if (CAN2_USED == 1)
  {                             // CAN2 Tx Buffer object capabilities
    1U,                         // Object supports transmission
    0U,                         // Object does not support reception
    0U,                         // Object does not support RTR reception and automatic Data transmission
    0U,                         // Object does not support RTR transmission and automatic Data reception
    0U,                         // Object does not allow assignment of multiple filters to it
    0U,                         // Object does not support exact identifier filtering
    0U,                         // Object does not support range identifier filtering
    0U,                         // Object does not support mask identifier filtering
    1U                          // Object can buffer 1 message
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  }
#else
  { 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U
#if (defined(ARM_CAN_API_VERSION) && (ARM_CAN_API_VERSION >= 0x101U))
  , 0U
#endif
  }
#endif
};

typedef struct _CAN_DRV_CONFIG {// Compile time configuration of driver structure
  uint32_t FILTER_STD_NUM;      // Number of Standard IDs
  uint32_t FILTER_EXT_NUM;      // Number of Extended IDs
  uint32_t RX_FIFO0_ELEM_NUM;   // Number of Rx FIFO0 elements
  uint32_t RX_FIFO1_ELEM_NUM;   // Number of Rx FIFO1 elements
  uint32_t TX_FIFO_ELEM_NUM;    // Number of Tx FIFO elements
  uint32_t RX_FIFO_OBJ_NUM;     // Number of Rx FIFO objects
  uint32_t RX_FIFO_OBJ_IDX_MAX; // Maximum index of Rx FIFO object (0=no max index, 1..n=index+1)
  uint32_t RX_BUF_OBJ_NUM;      // Number of Rx buffer objects
  uint32_t RX_BUF_OBJ_IDX_MAX;  // Maximum index of Rx buffer object (0=no max index, 1..n=index+1)
  uint32_t RX_TOT_OBJ_NUM;      // Number of all Rx FIFO and buffer objects
  uint32_t TX_FIFO_OBJ_NUM;     // Number of Tx FIFO objects
  uint32_t TX_FIFO_OBJ_IDX_MAX; // Maximum index of Tx FIFO object (0=no max index, 1..n=index+1)
  uint32_t TX_BUF_OBJ_NUM;      // Number of Tx buffer objects
  uint32_t TX_BUF_OBJ_IDX_MAX;  // Maximum index of Tx buffer object (0=no max index, 1..n=index+1)
  uint32_t TX_TOT_OBJ_NUM;      // Number of all Tx FIFO and buffer objects
  uint32_t TOT_OBJ_NUM;         // Number of all Rx + Tx objects
} CAN_DRV_CONFIG_t;

typedef struct _CAN_RAM_PTR {   // RAM pointers to areas of filters and buffers structure
  uint32_t *PTR_STD_ID;         // Pointer to Standard IDs RAM
  uint32_t *PTR_EXT_ID;         // Pointer to Extended IDs RAM
  uint32_t *PTR_RX_FIFO0;       // Pointer to Rx FIFO0 RAM
  uint32_t *PTR_RX_FIFO1;       // Pointer to Rx FIFO1 RAM
  uint32_t *PTR_RX_BUFFER;      // Pointer to Rx buffers RAM
  uint32_t *PTR_TX_EVENT_FIFO;  // Pointer to Tx Event FIFO RAM
  uint32_t *PTR_TX_BUFFER;      // Pointer to Tx buffers RAM
} CAN_RAM_PTR_t;

#if (CAN1_USED == 1)
// Statically allocated RAM for filters and buffers for CAN1 controller
static uint32_t         CAN1_RAM[CAN1_TOT_RAM] __MEMORY_AT(0x4000AC00);
#endif
#if (CAN2_USED == 1)
// Statically allocated RAM for filters and buffers for CAN2 controller
static uint32_t         CAN2_RAM[CAN2_TOT_RAM] __MEMORY_AT(0x4000C000);
#endif

