cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Driver/FDCAN_STM32H7xx.c
// Encodings of DLC and LEC to speed up their usage
static const uint8_t    CAN_DLC_ENCODE [16] =  { 0U, 1U, 2U, 3U, 4U, 5U, 6U, 7U, 8U, 12U, 16U, 20U, 24U, 32U, 48U, 64U };
static const uint8_t    CAN_LEC_ENCODE [ 8] =  { ARM_CAN_LEC_NO_ERROR,  ARM_CAN_LEC_STUFF_ERROR, ARM_CAN_LEC_FORM_ERROR, ARM_CAN_LEC_ACK_ERROR,
                                                 ARM_CAN_LEC_BIT_ERROR, ARM_CAN_LEC_BIT_ERROR  , ARM_CAN_LEC_CRC_ERROR,  ARM_CAN_LEC_NO_ERROR };

// Compile time configuration of drivers
static const CAN_DRV_CONFIG_t CAN_DRV_CONFIG [ 2] = {
#if (CAN1_USED == 1)
                                               { CAN1_FILTER_STD_NUM,
                                                 CAN1_FILTER_EXT_NUM,
                                                 CAN1_RX_FIFO0_ELEM_NUM,
                                                 CAN1_RX_FIFO1_ELEM_NUM,
                                                 CAN1_TX_FIFO_ELEM_NUM,
                                                 CAN1_RX_FIFO_OBJ_NUM,
                                               ( CAN1_RX_FIFO_OBJ_NUM *(CAN1_RX_FIFO_OBJ_NUM != 0U)),
                                                 CAN1_RX_BUF_OBJ_NUM,
                                               ((CAN1_RX_FIFO_OBJ_NUM + CAN1_RX_BUF_OBJ_NUM)*(CAN1_RX_BUF_OBJ_NUM != 0U)),
                                                (CAN1_RX_FIFO_OBJ_NUM + CAN1_RX_BUF_OBJ_NUM),
                                                 CAN1_TX_FIFO_OBJ_NUM,
                                               ((CAN1_RX_FIFO_OBJ_NUM + CAN1_RX_BUF_OBJ_NUM + CAN1_TX_FIFO_OBJ_NUM)*(CAN1_TX_FIFO_OBJ_NUM != 0U)),
                                                 CAN1_TX_BUF_OBJ_NUM,
                                               ((CAN1_RX_FIFO_OBJ_NUM + CAN1_RX_BUF_OBJ_NUM + CAN1_TX_FIFO_OBJ_NUM + CAN1_TX_BUF_OBJ_NUM)*(CAN1_TX_BUF_OBJ_NUM != 0U)),
                                                (CAN1_TX_FIFO_OBJ_NUM + CAN1_TX_BUF_OBJ_NUM),
                                                 CAN1_TOT_OBJ_NUM },
#else
                                               { 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U },
#endif
#if (CAN2_USED == 1)
                                               { CAN2_FILTER_STD_NUM,
                                                 CAN2_FILTER_EXT_NUM,
                                                 CAN2_RX_FIFO0_ELEM_NUM,
                                                 CAN2_RX_FIFO1_ELEM_NUM,
                                                 CAN2_TX_FIFO_ELEM_NUM,
                                                 CAN2_RX_FIFO_OBJ_NUM,
                                               ( CAN2_RX_FIFO_OBJ_NUM *(CAN2_RX_FIFO_OBJ_NUM != 0U)),
                                                 CAN2_RX_BUF_OBJ_NUM,
                                               ((CAN2_RX_FIFO_OBJ_NUM + CAN2_RX_BUF_OBJ_NUM)*(CAN2_RX_BUF_OBJ_NUM != 0U)),
                                                (CAN2_RX_FIFO_OBJ_NUM + CAN2_RX_BUF_OBJ_NUM),
                                                 CAN2_TX_FIFO_OBJ_NUM,
                                               ((CAN2_RX_FIFO_OBJ_NUM + CAN2_RX_BUF_OBJ_NUM + CAN2_TX_FIFO_OBJ_NUM)*(CAN2_TX_FIFO_OBJ_NUM != 0U)),
                                                 CAN2_TX_BUF_OBJ_NUM,
                                               ((CAN2_RX_FIFO_OBJ_NUM + CAN2_RX_BUF_OBJ_NUM + CAN2_TX_FIFO_OBJ_NUM + CAN2_TX_BUF_OBJ_NUM)*(CAN2_TX_BUF_OBJ_NUM != 0U)),
                                                (CAN2_TX_FIFO_OBJ_NUM + CAN2_TX_BUF_OBJ_NUM),
                                                 CAN2_TOT_OBJ_NUM },
#else
                                               { 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U },
#endif
                                              };

// Compile time RAM pointers to areas of filters and buffers
static const CAN_RAM_PTR_t CAN_RAM_PTR    [ 2] = {
#if (CAN1_USED == 1)
                                               { &CAN1_RAM[CAN1_RAM_OFS_STD_ID],
                                                 &CAN1_RAM[CAN1_RAM_OFS_EXT_ID],
                                                 &CAN1_RAM[CAN1_RAM_OFS_RX_FIFO0],
                                                 &CAN1_RAM[CAN1_RAM_OFS_RX_FIFO1],
                                                 &CAN1_RAM[CAN1_RAM_OFS_RX_BUFFER],
                                                 &CAN1_RAM[CAN1_RAM_OFS_TX_EVENT_FIFO],
                                                 &CAN1_RAM[CAN1_RAM_OFS_TX_BUFFER] },
#else
                                               { NULL, NULL, NULL, NULL, NULL, NULL, NULL },
#endif
#if (CAN2_USED == 1)
                                               { &CAN2_RAM[CAN2_RAM_OFS_STD_ID],
                                                 &CAN2_RAM[CAN2_RAM_OFS_EXT_ID],
                                                 &CAN2_RAM[CAN2_RAM_OFS_RX_FIFO0],
                                                 &CAN2_RAM[CAN2_RAM_OFS_RX_FIFO1],
                                                 &CAN2_RAM[CAN2_RAM_OFS_RX_BUFFER],
                                                 &CAN2_RAM[CAN2_RAM_OFS_TX_EVENT_FIFO],
                                                 &CAN2_RAM[CAN2_RAM_OFS_TX_BUFFER] }
#else
                                               { NULL, NULL, NULL, NULL, NULL, NULL, NULL }
#endif
                                              };

// Const variables for simplifying access to CAN instances
static FDCAN_GlobalTypeDef * const ptr_regs_CANx[2]  =  { FDCAN1, FDCAN2 };
static FDCAN_HandleTypeDef * const ptr_hndl_CANx[2]  =  {
#if (CAN1_USED == 1)
                                                         &hfdcan1,
#else
                                                          NULL,
#endif
#if (CAN2_USED == 1)
                                                         &hfdcan2
#else
                                                          NULL
#endif
                                                        };
static const IRQn_Type             FDCANx_IRQn[2][2] = {{ FDCAN1_IT0_IRQn, FDCAN1_IT1_IRQn }, { FDCAN2_IT0_IRQn, FDCAN2_IT1_IRQn }};

// Runtime variables
static uint8_t                     can_driver_initialized[CAN_CTRL_NUM] = {
#if (CAN_CTRL_NUM > 1)
                                                                            0U,
#endif
#if (CAN_CTRL_NUM > 0)
                                                                            0U
#endif
                                                                          };
static uint8_t                     can_driver_powered    [CAN_CTRL_NUM];
static uint8_t                     can_driver_fd_mode    [CAN_CTRL_NUM];
static uint8_t                     can_obj_cfg_access    [CAN_CTRL_NUM];
static uint32_t                    can_obj_rx_cfg        [CAN_CTRL_NUM][2];
static uint32_t                    can_obj_tx_cfg        [CAN_CTRL_NUM];
static uint32_t                    can_tx_obj_active     [CAN_CTRL_NUM];
static uint8_t                     can_filter_std_num    [CAN_CTRL_NUM];
static uint8_t                     can_filter_ext_num    [CAN_CTRL_NUM];
static ARM_CAN_SignalUnitEvent_t   CAN_SignalUnitEvent   [CAN_CTRL_NUM];
static ARM_CAN_SignalObjectEvent_t CAN_SignalObjectEvent [CAN_CTRL_NUM];


// CAN Driver Functions

/**
  \fn          ARM_DRIVER_VERSION CAN_GetVersion (void)
  \brief       Get driver version.
  \return      ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION CAN_GetVersion (void) { return can_driver_version; }

/**
  \fn          ARM_CAN_CAPABILITIES CAN1_GetCapabilities (void)
  \fn          ARM_CAN_CAPABILITIES CAN2_GetCapabilities (void)
  \brief       Get driver capabilities.
  \return      ARM_CAN_CAPABILITIES
*/
#if (CAN1_USED == 1)
static ARM_CAN_CAPABILITIES CAN1_GetCapabilities (void) { return can_driver_capabilities[0U]; }
#endif
#if (CAN2_USED == 1)
static ARM_CAN_CAPABILITIES CAN2_GetCapabilities (void) { return can_driver_capabilities[1U]; }
#endif
/**
  \fn          int32_t CANx_Initialize (ARM_CAN_SignalUnitEvent_t   cb_unit_event,
                                        ARM_CAN_SignalObjectEvent_t cb_object_event,
                                        uint8_t                     x)
  \brief       Initialize CAN interface and register signal (callback) functions.
  \param[in]   cb_unit_event   Pointer to ARM_CAN_SignalUnitEvent callback function
  \param[in]   cb_object_event Pointer to ARM_CAN_SignalObjectEvent callback function
  \param[in]   x               Controller number (0..1)
  \return      execution status
*/
static int32_t CANx_Initialize (ARM_CAN_SignalUnitEvent_t   cb_unit_event,
                                ARM_CAN_SignalObjectEvent_t cb_object_event,
                                uint8_t                     x) {

  if (x >= CAN_CTRL_NUM)               { return ARM_DRIVER_ERROR; }
  if (can_driver_initialized[x] != 0U) { return ARM_DRIVER_OK;    }

