cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Driver/FDCAN_STM32H7xx.c
  CAN_SignalUnitEvent  [x] = cb_unit_event;
  CAN_SignalObjectEvent[x] = cb_object_event;

  ptr_hndl_CANx[x]->Instance = ptr_regs_CANx[x];

  can_driver_powered[x] = 0U;

  can_driver_initialized[x] = 1U;

  return ARM_DRIVER_OK;
}
#if (CAN1_USED == 1)
static int32_t CAN1_Initialize (ARM_CAN_SignalUnitEvent_t cb_unit_event, ARM_CAN_SignalObjectEvent_t cb_object_event) { return CANx_Initialize (cb_unit_event, cb_object_event, 0U); }
#endif
#if (CAN2_USED == 1)
static int32_t CAN2_Initialize (ARM_CAN_SignalUnitEvent_t cb_unit_event, ARM_CAN_SignalObjectEvent_t cb_object_event) { return CANx_Initialize (cb_unit_event, cb_object_event, 1U); }
#endif

/**
  \fn          int32_t CANx_Uninitialize (uint8_t x)
  \brief       De-initialize CAN interface.
  \param[in]   x      Controller number (0..1)
  \return      execution status
*/
static int32_t CANx_Uninitialize (uint8_t x) {

  if (x >= CAN_CTRL_NUM) { return ARM_DRIVER_ERROR; }

  can_driver_initialized[x] = 0U;

  return ARM_DRIVER_OK;
}
#if (CAN1_USED == 1)
static int32_t CAN1_Uninitialize (void) { return CANx_Uninitialize (0U); }
#endif
#if (CAN2_USED == 1)
static int32_t CAN2_Uninitialize (void) { return CANx_Uninitialize (1U); }
#endif

/**
  \fn          int32_t CANx_PowerControl (ARM_POWER_STATE state, uint8_t x)
  \brief       Control CAN interface power.
  \param[in]   state  Power state
                 - ARM_POWER_OFF :  power off: no operation possible
                 - ARM_POWER_LOW :  low power mode: retain state, detect and signal wake-up events
                 - ARM_POWER_FULL : power on: full operation at maximum performance
  \param[in]   x      Controller number (0..1)
  \return      execution status
*/
static int32_t CANx_PowerControl (ARM_POWER_STATE state, uint8_t x) {
  FDCAN_GlobalTypeDef *ptr_CAN;

  if (x >= CAN_CTRL_NUM) { return ARM_DRIVER_ERROR; }

  ptr_CAN = ptr_regs_CANx[x];

  switch (state) {
    case ARM_POWER_OFF:
      can_driver_powered[x] = 0U;
      ptr_CAN->IE           = 0U;
      ptr_CAN->IR           = 0xFFFFFFFFU;
      ptr_CAN->ILE          = 0U;
      NVIC_DisableIRQ     (FDCANx_IRQn[x][0]);
      NVIC_ClearPendingIRQ(FDCANx_IRQn[x][0]);
      NVIC_DisableIRQ     (FDCANx_IRQn[x][1]);
      NVIC_ClearPendingIRQ(FDCANx_IRQn[x][1]);
      if (ptr_hndl_CANx[x]->Instance != NULL) {
        HAL_FDCAN_MspDeInit(ptr_hndl_CANx[x]);
      }
      break;

    case ARM_POWER_FULL:
      if (can_driver_initialized[x] == 0U) { return ARM_DRIVER_ERROR; }
      if (can_driver_powered[x]     != 0U) { return ARM_DRIVER_OK;    }

      if (ptr_hndl_CANx[x]->Instance != NULL) {
        HAL_FDCAN_MspInit(ptr_hndl_CANx[x]);
      }

      // Clear runtime variables
      can_driver_fd_mode[x] = 0U;
      can_obj_cfg_access[x] = 0U;
      can_obj_rx_cfg[x][0]  = 0U;
      can_obj_rx_cfg[x][1]  = 0U;
      can_obj_tx_cfg[x]     = 0U;
      can_tx_obj_active[x]  = 0U;
      can_filter_std_num[x] = 0U;
      can_filter_ext_num[x] = 0U;

      // Set peripheral to initialization and configuration change enable to set RAM pointers
      ptr_CAN->CCCR = FDCAN_CCCR_INIT; while ((ptr_CAN->CCCR & FDCAN_CCCR_INIT) == 0U);
      ptr_CAN->CCCR = FDCAN_CCCR_INIT | FDCAN_CCCR_CCE;

      switch (x) {
#if (CAN1_USED == 1)
        case 0:
          memset((void *)CAN1_RAM, 0U, sizeof(CAN1_RAM));
          break;
#endif
#if (CAN2_USED == 1)
        case 1:
          memset((void *)CAN2_RAM, 0U, sizeof(CAN2_RAM));
          break;
#endif
        default:
          return ARM_DRIVER_ERROR;
      }

      // Configure memory areas for filters and Rx/Tx buffers, FIFOs for Rx and Tx are not used
      // Rx Buffers are configured for 64 byte data field to accommodate maximum CAN FD message
      // Tx Buffers are configured for 64 byte data field to accommodate maximum CAN FD message
      ptr_CAN->SIDFC = (FDCAN_SIDFC_LSS   &  (CAN_DRV_CONFIG[x].FILTER_STD_NUM    << FDCAN_SIDFC_LSS_Pos) ) |
                       (FDCAN_SIDFC_FLSSA & ((uint32_t)(CAN_RAM_PTR[x].PTR_STD_ID)        - CAN_RAM_BASE) ) ;
      ptr_CAN->XIDFC = (FDCAN_XIDFC_LSE   &  (CAN_DRV_CONFIG[x].FILTER_EXT_NUM    << FDCAN_XIDFC_LSE_Pos) ) |
                       (FDCAN_XIDFC_FLESA & ((uint32_t)(CAN_RAM_PTR[x].PTR_EXT_ID)        - CAN_RAM_BASE) ) ;
      ptr_CAN->RXF0C = (FDCAN_RXF0C_F0S   &  (CAN_DRV_CONFIG[x].RX_FIFO0_ELEM_NUM << FDCAN_RXF0C_F0S_Pos) ) |
                       (FDCAN_RXF0C_F0SA  & ((uint32_t)(CAN_RAM_PTR[x].PTR_RX_FIFO0)      - CAN_RAM_BASE) ) ;
      ptr_CAN->RXF1C = (FDCAN_RXF1C_F1S   &  (CAN_DRV_CONFIG[x].RX_FIFO1_ELEM_NUM << FDCAN_RXF1C_F1S_Pos) ) |
                       (0xFFFCU           & ((uint32_t)(CAN_RAM_PTR[x].PTR_RX_FIFO1)      - CAN_RAM_BASE) ) ;
      ptr_CAN->RXBC  = (0xFFFCU           & ((uint32_t)(CAN_RAM_PTR[x].PTR_RX_BUFFER)     - CAN_RAM_BASE) ) ;
      ptr_CAN->RXESC = (FDCAN_RXESC_F0DS  &  (7U                                  << FDCAN_RXESC_F0DS_Pos)) |
                       (FDCAN_RXESC_F1DS  &  (7U                                  << FDCAN_RXESC_F1DS_Pos)) |
                       (FDCAN_RXESC_RBDS  &  (7U                                  << FDCAN_RXESC_RBDS_Pos)) ;
      ptr_CAN->TXEFC = (FDCAN_TXEFC_EFS   &  (CAN_DRV_CONFIG[x].TX_FIFO_ELEM_NUM  << FDCAN_TXEFC_EFS_Pos )) |
                       (0xFFFCU           & ((uint32_t)(CAN_RAM_PTR[x].PTR_TX_EVENT_FIFO) - CAN_RAM_BASE) ) ;
      ptr_CAN->TXBC  = (FDCAN_TXBC_NDTB   &  (CAN_DRV_CONFIG[x].TX_BUF_OBJ_NUM    << FDCAN_TXBC_NDTB_Pos) ) |
                       (FDCAN_TXBC_TFQS   &  (CAN_DRV_CONFIG[x].TX_FIFO_ELEM_NUM  << FDCAN_TXBC_TFQS_Pos) ) |
                       (0xFFFCU           & ((uint32_t)(CAN_RAM_PTR[x].PTR_TX_BUFFER)     - CAN_RAM_BASE) ) ;
      ptr_CAN->TXESC = (FDCAN_TXESC_TBDS  &  (7U                                  << FDCAN_TXESC_TBDS_Pos)) ;

      // Reject non-matching frames
      ptr_CAN->GFC   = (FDCAN_GFC_ANFE & (3U << FDCAN_GFC_ANFE_Pos)) | (FDCAN_GFC_ANFS & (3U << FDCAN_GFC_ANFS_Pos));

      // Route all interrupt sources to m_can_int0 and enable it
      ptr_CAN->ILS = 0U;
      ptr_CAN->ILE = FDCAN_ILE_EINT0;

      // Enable relevant interrupts
      ptr_CAN->IR  = 0xFFFFFFFFU;
      ptr_CAN->IE  = FDCAN_IE_TCE | FDCAN_IE_DRXE | FDCAN_IE_EPE | FDCAN_IE_EWE | FDCAN_IE_BOE;

