cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Driver/FDCAN_STM32H7xx.c
  if         (obj_idx < CAN_DRV_CONFIG[x].RX_FIFO_OBJ_IDX_MAX) {
    if (obj_idx == 0U) {
      return can_object_capabilities_rx_fifo0[x];
    } else {
      return can_object_capabilities_rx_fifo1[x];
    }
  } else if  (obj_idx < CAN_DRV_CONFIG[x].RX_BUF_OBJ_IDX_MAX) {
    return can_object_capabilities_rx_buffer[x];
  } else if  (obj_idx < CAN_DRV_CONFIG[x].TX_FIFO_OBJ_IDX_MAX) {
    return can_object_capabilities_tx_fifo[x];
  } else {
    return can_object_capabilities_tx_buffer[x];
  }
}
#if (CAN1_USED == 1)
static ARM_CAN_OBJ_CAPABILITIES CAN1_ObjectGetCapabilities (uint32_t obj_idx) { return CANx_ObjectGetCapabilities (obj_idx, 0U); }
#endif
#if (CAN2_USED == 1)
static ARM_CAN_OBJ_CAPABILITIES CAN2_ObjectGetCapabilities (uint32_t obj_idx) { return CANx_ObjectGetCapabilities (obj_idx, 1U); }
#endif

/**
  \fn          int32_t CANx_ObjectSetFilter (uint32_t obj_idx, ARM_CAN_FILTER_OPERATION operation, uint32_t id, uint32_t arg, uint8_t x)
  \brief       Add or remove filter for message reception.
  \param[in]   obj_idx      Object index of object that filter should be or is assigned to
  \param[in]   operation    Operation on filter
                 - ARM_CAN_FILTER_ID_EXACT_ADD :       add    exact id filter
                 - ARM_CAN_FILTER_ID_EXACT_REMOVE :    remove exact id filter
                 - ARM_CAN_FILTER_ID_RANGE_ADD :       add    range id filter
                 - ARM_CAN_FILTER_ID_RANGE_REMOVE :    remove range id filter
                 - ARM_CAN_FILTER_ID_MASKABLE_ADD :    add    maskable id filter
                 - ARM_CAN_FILTER_ID_MASKABLE_REMOVE : remove maskable id filter
  \param[in]   id           ID or start of ID range (depending on filter type)
  \param[in]   arg          Mask or end of ID range (depending on filter type)
  \param[in]   x            Controller number (0..1)
  \return      execution status
*/
static int32_t CANx_ObjectSetFilter (uint32_t obj_idx, ARM_CAN_FILTER_OPERATION operation, uint32_t id, uint32_t arg, uint8_t x) {
  uint32_t *ptr_filter_RAM;
  uint32_t  i, val0, val1;

  if (x >= CAN_CTRL_NUM)                           { return ARM_DRIVER_ERROR; }
  if (obj_idx >= CAN_DRV_CONFIG[x].RX_TOT_OBJ_NUM) { return ARM_DRIVER_ERROR; }
  if (can_driver_powered[x] == 0U)                 { return ARM_DRIVER_ERROR; }

  switch (operation) {
    case ARM_CAN_FILTER_ID_MASKABLE_ADD:                // Add
    case ARM_CAN_FILTER_ID_RANGE_ADD:
      // Maskable and range filters are only supported on Rx FIFO
      if (obj_idx >= CAN_DRV_CONFIG[x].RX_FIFO_OBJ_IDX_MAX) { return ARM_DRIVER_ERROR; }
    case ARM_CAN_FILTER_ID_EXACT_ADD:
      if ((id & ARM_CAN_ID_IDE_Msk) != 0U) {            // Extended Identifier
        if (can_filter_ext_num[x] >= CAN_DRV_CONFIG[x].FILTER_EXT_NUM) { return ARM_DRIVER_ERROR; }
        switch (operation) {
          case ARM_CAN_FILTER_ID_EXACT_ADD:
            if (obj_idx < CAN_DRV_CONFIG[x].RX_FIFO_OBJ_IDX_MAX) {
              // If Rx FIFO is used for reception on this object
              ptr_filter_RAM = CAN_RAM_PTR[x].PTR_EXT_ID;
              for (i = 0U; i < can_filter_ext_num[x]; i++) {
                if ((((ptr_filter_RAM[i*2U+1U] >> 30) & 3U) == 1U)             &&       // If Dual ID entry
                    (((ptr_filter_RAM[i*2U]    >> 29) & 7U) == (obj_idx + 1U))) {       // If same FIFO is assigned
                  if        ((ptr_filter_RAM[i*2U]    & 0x1FFFFFFFU) == 0U) {
                    // First entry in Dual ID entry is unused
                    ptr_filter_RAM[i*2U]    |= (id  & 0x1FFFFFFFU);
                    break;
                  } else if ((ptr_filter_RAM[i*2U+1U] & 0x1FFFFFFFU) == 0U) {
                    // Second entry in Dual ID entry is unused
                    ptr_filter_RAM[i*2U+1U] |= (id  & 0x1FFFFFFFU);
                    break;
                  }
                }
              }
              if (i == can_filter_ext_num[x]) {
                // No free entry in Dual ID entries, add new Dual ID entry
                ptr_filter_RAM    = (uint32_t *)(CAN_RAM_PTR[x].PTR_EXT_ID + can_filter_ext_num[x] * 2U);
                ptr_filter_RAM[0] = ((obj_idx + 1U) << 29) | (id  & 0x1FFFFFFFU);
                ptr_filter_RAM[1] = (1U             << 30);
                can_filter_ext_num[x]++;
              }
            } else {
              // If Rx Buffer is used for reception on this object
              ptr_filter_RAM    = (uint32_t *)(CAN_RAM_PTR[x].PTR_EXT_ID + can_filter_ext_num[x] * 2U);
              ptr_filter_RAM[0] = (7U             << 29) | (id & 0x1FFFFFFFU);
              ptr_filter_RAM[1] =  obj_idx - CAN_DRV_CONFIG[x].RX_FIFO_OBJ_NUM;
              can_filter_ext_num[x]++;
            }
            break;
          case ARM_CAN_FILTER_ID_MASKABLE_ADD:
            ptr_filter_RAM    =   (uint32_t *)(CAN_RAM_PTR[x].PTR_EXT_ID + can_filter_ext_num[x] * 2U);
            ptr_filter_RAM[0] =   ((obj_idx + 1U) << 29) | (id  & 0x1FFFFFFFU);
            ptr_filter_RAM[1] =   (2U             << 30) | (arg & 0x1FFFFFFFU);
            can_filter_ext_num[x]++;
            break;
          case ARM_CAN_FILTER_ID_RANGE_ADD:
            ptr_filter_RAM    =   (uint32_t *)(CAN_RAM_PTR[x].PTR_EXT_ID + can_filter_ext_num[x] * 2U);
            ptr_filter_RAM[0] =   ((obj_idx + 1U) << 29) | (id  & 0x1FFFFFFFU);
            ptr_filter_RAM[1] =                            (arg & 0x1FFFFFFFU);
            can_filter_ext_num[x]++;
            break;
          case ARM_CAN_FILTER_ID_EXACT_REMOVE:
          case ARM_CAN_FILTER_ID_MASKABLE_REMOVE:
          case ARM_CAN_FILTER_ID_RANGE_REMOVE:
          default:
            return ARM_DRIVER_ERROR;
        }
      } else {                                          // Standard Identifier
        if (can_filter_std_num[x] >= CAN_DRV_CONFIG[x].FILTER_STD_NUM) { return ARM_DRIVER_ERROR; }
        switch (operation) {
          case ARM_CAN_FILTER_ID_EXACT_ADD:
            if (obj_idx < CAN_DRV_CONFIG[x].RX_FIFO_OBJ_IDX_MAX) {
              // If Rx FIFO is used for reception on this object
              ptr_filter_RAM = CAN_RAM_PTR[x].PTR_STD_ID;
              for (i = 0U; i < can_filter_std_num[x]; i++) {
                if ((((ptr_filter_RAM[i] >> 30) & 3U) == 1U)             &&     // If Dual ID entry
                    (((ptr_filter_RAM[i] >> 27) & 7U) == (obj_idx + 1U))) {     // If same FIFO is assigned
                  if        ((ptr_filter_RAM[i] & (0x7FFU << 16)) == 0U) {
                    // First entry in Dual ID entry is unused
                    ptr_filter_RAM[i] |= ((id & 0x7FFU) << 16);
                    break;
                  } else if ((ptr_filter_RAM[i] & (0x7FFU)      ) == 0U) {
                    // Second entry in Dual ID entry is unused
                    ptr_filter_RAM[i] |=  (id & 0x7FFU);
                    break;
                  }
                }
              }
              if (i == can_filter_std_num[x]) {
                // No free entry in Dual ID entries, add new Dual ID entry
                ptr_filter_RAM    = (uint32_t *)(CAN_RAM_PTR[x].PTR_STD_ID + can_filter_std_num[x]);
                ptr_filter_RAM[0] = (1U << 30) | ((obj_idx + 1U) << 27) | ((id & 0x7FFU) << 16);
                can_filter_std_num[x]++;
              }
            } else {
              // If Rx Buffer is used for reception on this object
              ptr_filter_RAM    =   (uint32_t *)(CAN_RAM_PTR[x].PTR_STD_ID + can_filter_std_num[x]);
              ptr_filter_RAM[0] =               (7U            << 27) | ((id & 0x7FFU) << 16) | (obj_idx - CAN_DRV_CONFIG[x].RX_FIFO_OBJ_NUM);
              can_filter_std_num[x]++;
            }
            break;
          case ARM_CAN_FILTER_ID_MASKABLE_ADD:
            ptr_filter_RAM    =     (uint32_t *)(CAN_RAM_PTR[x].PTR_STD_ID + can_filter_std_num[x]);
            ptr_filter_RAM[0] =     (2U << 30) | ((obj_idx + 1U) << 27) | ((id & 0x7FFU) << 16) | (arg & 0x7FFU);
            can_filter_std_num[x]++;
            break;
          case ARM_CAN_FILTER_ID_RANGE_ADD:
            ptr_filter_RAM    =     (uint32_t *)(CAN_RAM_PTR[x].PTR_STD_ID + can_filter_std_num[x]);
            ptr_filter_RAM[0] =                  ((obj_idx + 1U) << 27) | ((id & 0x7FFU) << 16) | (arg & 0x7FFU);
            can_filter_std_num[x]++;
            break;
          case ARM_CAN_FILTER_ID_EXACT_REMOVE:
          case ARM_CAN_FILTER_ID_MASKABLE_REMOVE:
          case ARM_CAN_FILTER_ID_RANGE_REMOVE:
          default:
            return ARM_DRIVER_ERROR;
        }
      }
      break;
    case ARM_CAN_FILTER_ID_MASKABLE_REMOVE:             // Remove
    case ARM_CAN_FILTER_ID_RANGE_REMOVE:
      // Maskable and range filters are only supported on Rx FIFO
      if (obj_idx >= CAN_DRV_CONFIG[x].RX_FIFO_OBJ_IDX_MAX) { return ARM_DRIVER_ERROR; }
    case ARM_CAN_FILTER_ID_EXACT_REMOVE:
      if ((id & ARM_CAN_ID_IDE_Msk) != 0U) {            // Extended Identifier
        if (can_filter_ext_num[x] == 0U) { return ARM_DRIVER_ERROR; }
        switch (operation) {
          case ARM_CAN_FILTER_ID_EXACT_REMOVE:
            if (obj_idx < CAN_DRV_CONFIG[x].RX_FIFO_OBJ_IDX_MAX) {
              // If Rx FIFO is used for reception on this object
              ptr_filter_RAM = CAN_RAM_PTR[x].PTR_EXT_ID;
              for (i = 0U; i < can_filter_ext_num[x]; i++) {
                if ((((ptr_filter_RAM[i*2U+1U] >> 30) & 3U) == 1U)             &&       // If Dual ID entry
                    (((ptr_filter_RAM[i*2U]    >> 29) & 7U) == (obj_idx + 1U))) {       // If same FIFO is assigned
                  if        ((ptr_filter_RAM[i*2U]    & 0x1FFFFFFFU) == (id & 0x1FFFFFFFU)) {
                    // First entry in Dual ID entry is the one to be removed
                    ptr_filter_RAM[i*2U] &= ~0x1FFFFFFFU;
                    if ((ptr_filter_RAM[i*2U+1U] & 0x1FFFFFFFU) == 0U) {
                      // Dual ID entry is free it can be removed
                      // Shift all remaining Extended ID filter entries 1 entry (64 bits) towards start of table
                      for (; i < can_filter_ext_num[x]; i++) {
                        ptr_filter_RAM[i*2U   ] = ptr_filter_RAM[i*2U+2U];
                        ptr_filter_RAM[i*2U+1U] = ptr_filter_RAM[i*2U+3U];
                      }
                      can_filter_ext_num[x]--;
                    }
                    return ARM_DRIVER_OK;
                  } else if ((ptr_filter_RAM[i*2U+1U] & 0x1FFFFFFFU) == (id & 0x1FFFFFFFU)) {
                    // Second entry in Dual ID entry is the one to be removed
                    ptr_filter_RAM[i*2U+1U] &= ~0x1FFFFFFFU;
                    if ((ptr_filter_RAM[i*2U]    & 0x1FFFFFFFU) == 0U) {
                      // Dual ID entry is free it can be removed
                      // Shift all remaining Extended ID filter entries 1 entry (64 bits) towards start of table
                      for (; i < can_filter_ext_num[x]; i++) {
                        ptr_filter_RAM[i*2U   ] = ptr_filter_RAM[i*2U+2U];
                        ptr_filter_RAM[i*2U+1U] = ptr_filter_RAM[i*2U+3U];
                      }
                      can_filter_ext_num[x]--;
                    }
                    return ARM_DRIVER_OK;
                  }
                }
              }
              return ARM_DRIVER_ERROR;
            } else {
              // If Rx Buffer is used for reception on this object
              val0 = (7U             << 29) | (id & 0x1FFFFFFFU);
              val1 =  obj_idx - CAN_DRV_CONFIG[x].RX_FIFO_OBJ_NUM;
            }
            break;
          case ARM_CAN_FILTER_ID_MASKABLE_REMOVE:
            val0 =   ((obj_idx + 1U) << 29) | (id  & 0x1FFFFFFFU);
            val1 =   (2U             << 30) | (arg & 0x1FFFFFFFU);
            break;
          case ARM_CAN_FILTER_ID_RANGE_REMOVE:
            val0 =   ((obj_idx + 1U) << 29) | (id  & 0x1FFFFFFFU);
            val1 =                            (arg & 0x1FFFFFFFU);
            break;
          case ARM_CAN_FILTER_ID_EXACT_ADD:
          case ARM_CAN_FILTER_ID_MASKABLE_ADD:
          case ARM_CAN_FILTER_ID_RANGE_ADD:
          default:
            return ARM_DRIVER_ERROR;
        }
        ptr_filter_RAM = CAN_RAM_PTR[x].PTR_EXT_ID;
        for (i = 0U; i < can_filter_ext_num[x]; i++) {
          if ((ptr_filter_RAM[i*2U]    == val0) &&
              (ptr_filter_RAM[i*2U+1U] == val1)) {
            // Entry to be removed was found
            // Shift all remaining Extended ID filter entries 1 entry (64 bits) towards start of table
            for (; i < can_filter_ext_num[x]; i++) {
              ptr_filter_RAM[i*2U   ] = ptr_filter_RAM[i*2U+2U];
              ptr_filter_RAM[i*2U+1U] = ptr_filter_RAM[i*2U+3U];
            }
            can_filter_ext_num[x]--;
            break;
          }
        }
      } else {                                          // Standard Identifier
        if (can_filter_std_num[x] == 0U) { return ARM_DRIVER_ERROR; }
        switch (operation) {
          case ARM_CAN_FILTER_ID_EXACT_REMOVE:
            if (obj_idx < CAN_DRV_CONFIG[x].RX_FIFO_OBJ_IDX_MAX) {
              // If Rx FIFO is used for reception on this object
              ptr_filter_RAM = CAN_RAM_PTR[x].PTR_STD_ID;
              for (i = 0U; i < can_filter_std_num[x]; i++) {
                if ((((ptr_filter_RAM[i] >> 30) & 3U) == 1U)             &&     // If Dual ID entry
                    (((ptr_filter_RAM[i] >> 27) & 7U) == (obj_idx + 1U))) {     // If same FIFO is assigned
                  if        (((ptr_filter_RAM[i] >> 16) & 0x7FFU) == (id & 0x7FFU)) {
                    // First entry in Dual ID entry is the one to be removed
                    ptr_filter_RAM[i] &= ~(0x7FFU << 16);
                    if ((ptr_filter_RAM[i] & 0x7FFU) == 0U) {
                      // Dual ID entry is free it can be removed
                      // Shift all remaining Standard ID filter entries 1 entry (32 bits) towards start of table
                      for (; i < can_filter_std_num[x]; i++) {
                        ptr_filter_RAM[i] = ptr_filter_RAM[i+1U];
                      }
                      can_filter_std_num[x]--;
                    }
                    return ARM_DRIVER_OK;
                  } else if ( (ptr_filter_RAM[i]        & 0x7FFU) == (id & 0x7FFU)) {
                    // Second entry in Dual ID entry is the one to be removed
                    ptr_filter_RAM[i] &= ~0x7FFU;
                    if ((ptr_filter_RAM[i] & (0x7FFU << 16)) == 0U) {
                      // Dual ID entry is free it can be removed
                      // Shift all remaining Standard ID filter entries 1 entry (32 bits) towards start of table
                      for (; i < can_filter_std_num[x]; i++) {
                        ptr_filter_RAM[i] = ptr_filter_RAM[i+1U];
                      }
                      can_filter_std_num[x]--;
                    }
                    return ARM_DRIVER_OK;
                  }
                }
              }
              return ARM_DRIVER_ERROR;
            } else {
              // If Rx Buffer is used for reception on this object
              val0 =               (7U            << 27) | ((id & 0x7FFU) << 16) | (obj_idx - CAN_DRV_CONFIG[x].RX_FIFO_OBJ_NUM);
            }
            break;
          case ARM_CAN_FILTER_ID_MASKABLE_REMOVE:
            val0 =   (2U << 30) | ((obj_idx + 1U) << 27) | ((id & 0x7FFU) << 16) | (arg & 0x7FFU);
            break;
          case ARM_CAN_FILTER_ID_RANGE_REMOVE:
            val0 =                ((obj_idx + 1U) << 27) | ((id & 0x7FFU) << 16) | (arg & 0x7FFU);
            break;
          case ARM_CAN_FILTER_ID_EXACT_ADD:
          case ARM_CAN_FILTER_ID_MASKABLE_ADD:
          case ARM_CAN_FILTER_ID_RANGE_ADD:
          default:
            return ARM_DRIVER_ERROR;
        }
        ptr_filter_RAM = CAN_RAM_PTR[x].PTR_STD_ID;
        for (i = 0U; i < can_filter_std_num[x]; i++) {
          if (ptr_filter_RAM[i] == val0) {
            // Entry to be removed was found
            // Shift all remaining Standard ID filter entries 1 entry (32 bits) towards start of table
            for (; i < can_filter_std_num[x]; i++) {
              ptr_filter_RAM[i] = ptr_filter_RAM[i+1U];
            }
            can_filter_std_num[x]--;
            break;
          }
        }
      }
      break;
    default:
      return ARM_DRIVER_ERROR_UNSUPPORTED;
  }

  return ARM_DRIVER_OK;
}
#if (CAN1_USED == 1)
static int32_t CAN1_ObjectSetFilter (uint32_t obj_idx, ARM_CAN_FILTER_OPERATION operation, uint32_t id, uint32_t arg) { return CANx_ObjectSetFilter (obj_idx, operation, id, arg, 0U); }
#endif
#if (CAN2_USED == 1)
static int32_t CAN2_ObjectSetFilter (uint32_t obj_idx, ARM_CAN_FILTER_OPERATION operation, uint32_t id, uint32_t arg) { return CANx_ObjectSetFilter (obj_idx, operation, id, arg, 1U); }
#endif

/**
  \fn          int32_t CANx_ObjectConfigure (uint32_t obj_idx, ARM_CAN_OBJ_CONFIG obj_cfg, uint8_t x)
  \brief       Configure object.
  \param[in]   obj_idx  Object index
  \param[in]   obj_cfg  Object configuration state
                 - ARM_CAN_OBJ_INACTIVE :       deactivate object
                 - ARM_CAN_OBJ_RX :             configure object for reception
                 - ARM_CAN_OBJ_TX :             configure object for transmission
                 - ARM_CAN_OBJ_RX_RTR_TX_DATA : configure object that on RTR reception automatically transmits Data Frame
                 - ARM_CAN_OBJ_TX_RTR_RX_DATA : configure object that transmits RTR and automatically receives Data Frame
  \param[in]   x        Controller number (0..1)
  \return      execution status
*/
static int32_t CANx_ObjectConfigure (uint32_t obj_idx, ARM_CAN_OBJ_CONFIG obj_cfg, uint8_t x) {
  FDCAN_GlobalTypeDef *ptr_CAN;
  uint32_t             msk;

  if (x >= CAN_CTRL_NUM)                        { return ARM_DRIVER_ERROR;           }
  if (obj_idx >= CAN_DRV_CONFIG[x].TOT_OBJ_NUM) { return ARM_DRIVER_ERROR_PARAMETER; }
  if (can_driver_powered[x] == 0U)              { return ARM_DRIVER_ERROR;           }
  if (can_obj_cfg_access[x] != 0U)              { return ARM_DRIVER_ERROR_BUSY;      }
  can_obj_cfg_access[x] = 1U;

  ptr_CAN = ptr_regs_CANx[x];

  switch (obj_cfg) {
    case ARM_CAN_OBJ_INACTIVE:
      if (obj_idx >= CAN_DRV_CONFIG[x].RX_TOT_OBJ_NUM) {        // If this is Tx object
        msk = 1U << ((obj_idx - CAN_DRV_CONFIG[x].RX_TOT_OBJ_NUM) & 0x1FU);
        can_obj_tx_cfg[x]    &= ~msk;
        if        (obj_idx < CAN_DRV_CONFIG[x].TX_FIFO_OBJ_IDX_MAX) {
          // If disabling Tx FIFO
          ptr_CAN->IE &= ~FDCAN_IE_TEFNE;
        } else if (obj_idx < CAN_DRV_CONFIG[x].TX_BUF_OBJ_IDX_MAX) {
          // If disabling Tx Buffer
          ptr_CAN->TXBTIE &= ~msk;
        }
      } else {                                          // If this is Rx object
        can_obj_rx_cfg[x][obj_idx >> 5] &= ~(1U << (obj_idx & 0x1FU));
        if        (obj_idx < CAN_DRV_CONFIG[x].RX_FIFO_OBJ_IDX_MAX) {
          // If disabling Rx FIFO
          if (obj_idx == 0U) {
            ptr_CAN->IE &= ~FDCAN_IE_RF0NE;
          } else {
            ptr_CAN->IE &= ~FDCAN_IE_RF1NE;
          }
        } else if (obj_idx < CAN_DRV_CONFIG[x].RX_BUF_OBJ_IDX_MAX) {
          // If disabling Rx Buffer
        }
      }
      break;
    case ARM_CAN_OBJ_TX:
      if (obj_idx < CAN_DRV_CONFIG[x].RX_TOT_OBJ_NUM) { can_obj_cfg_access[x] = 0U; return ARM_DRIVER_ERROR_PARAMETER; }
      msk = 1U << ((obj_idx - CAN_DRV_CONFIG[x].RX_TOT_OBJ_NUM) & 0x1FU);
      can_obj_tx_cfg[x]    |= msk;
      if        (obj_idx < CAN_DRV_CONFIG[x].TX_FIFO_OBJ_IDX_MAX) {
        // If enabling Tx FIFO
        ptr_CAN->IE |=  FDCAN_IE_TEFNE;
      } else if (obj_idx < CAN_DRV_CONFIG[x].TX_BUF_OBJ_IDX_MAX) {
        // If enabling Tx Buffer
        ptr_CAN->TXBTIE   |=  msk;
      }
      break;
    case ARM_CAN_OBJ_RX:
      if (obj_idx >= CAN_DRV_CONFIG[x].RX_TOT_OBJ_NUM) { can_obj_cfg_access[x] = 0U; return ARM_DRIVER_ERROR_PARAMETER; }
      if        (obj_idx < CAN_DRV_CONFIG[x].RX_FIFO_OBJ_IDX_MAX) {
        // If enabling Rx FIFO
        if (obj_idx == 0U) {
          ptr_CAN->IE |=  FDCAN_IE_RF0NE;
        } else {
          ptr_CAN->IE |=  FDCAN_IE_RF1NE;
        }
      }
      can_obj_rx_cfg[x][obj_idx >> 5] |= 1U << (obj_idx & 0x1FU);
      break;
    case ARM_CAN_OBJ_RX_RTR_TX_DATA:
    case ARM_CAN_OBJ_TX_RTR_RX_DATA:
    default:
      return ARM_DRIVER_ERROR;
  }
  can_obj_cfg_access[x] = 0U;

  return ARM_DRIVER_OK;
}
#if (CAN1_USED == 1)
static int32_t CAN1_ObjectConfigure (uint32_t obj_idx, ARM_CAN_OBJ_CONFIG obj_cfg) { return CANx_ObjectConfigure (obj_idx, obj_cfg, 0U); }
#endif
#if (CAN2_USED == 1)
static int32_t CAN2_ObjectConfigure (uint32_t obj_idx, ARM_CAN_OBJ_CONFIG obj_cfg) { return CANx_ObjectConfigure (obj_idx, obj_cfg, 1U); }
#endif

/**
  \fn          int32_t CANx_MessageSend (uint32_t obj_idx, ARM_CAN_MSG_INFO *msg_info, const uint8_t *data, uint8_t size, uint8_t x)
  \brief       Send message on CAN bus.
  \param[in]   obj_idx  Object index
  \param[in]   msg_info Pointer to CAN message information
  \param[in]   data     Pointer to data buffer
  \param[in]   size     Number of data bytes to send
  \param[in]   x        Controller number (0..1)
  \return      value >= 0  number of data bytes accepted to send
  \return      value < 0   execution status
*/
static int32_t CANx_MessageSend (uint32_t obj_idx, ARM_CAN_MSG_INFO *msg_info, const uint8_t *data, uint8_t size, uint8_t x) {
  FDCAN_GlobalTypeDef *ptr_CAN;
  uint32_t            *ptr_buffer_RAM;
  uint32_t            *dest32;
  const uint32_t      *src32;
  const uint8_t       *src8;
  uint32_t             t0, i, tx_obj_idx, buf_ofs_idx, val;

  if (x >= CAN_CTRL_NUM)                                                                          { return ARM_DRIVER_ERROR;           }
  if ((obj_idx < CAN_DRV_CONFIG[x].RX_TOT_OBJ_NUM) || (obj_idx >= CAN_DRV_CONFIG[x].TOT_OBJ_NUM)) { return ARM_DRIVER_ERROR_PARAMETER; }
  if (can_driver_powered[x] == 0U)                                                                { return ARM_DRIVER_ERROR;           }
  tx_obj_idx = (obj_idx - CAN_DRV_CONFIG[x].RX_TOT_OBJ_NUM) & 0x1FU;
  if ((can_obj_tx_cfg[x] & (1U << tx_obj_idx)) == 0U)                                             { return ARM_DRIVER_ERROR;           }

  ptr_CAN = ptr_regs_CANx[x];

  if (obj_idx < CAN_DRV_CONFIG[x].TX_FIFO_OBJ_IDX_MAX) {
    // Send using Tx FIFO
    buf_ofs_idx = ((ptr_CAN->TXFQS & FDCAN_TXFQS_TFQPI_Msk) >> FDCAN_TXFQS_TFQPI_Pos);
  } else {
    // Send using Tx Buffer
    buf_ofs_idx = tx_obj_idx;
  }
  ptr_buffer_RAM = CAN_RAM_PTR[x].PTR_TX_BUFFER + (buf_ofs_idx * 18U);

