cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Driver/FDCAN_STM32H7xx.c
  if ((msg_info->id & ARM_CAN_ID_IDE_Msk) == 0U) {      // Standard ID
    t0 = (msg_info->id & 0x7FFU) << 18;
  } else {                                              // Extended ID
    t0 = (msg_info->id & 0x1FFFFFFFU) | (1U << 30);
  }

  if (msg_info->rtr != 0U) {                            // RTR message
    t0 |= 1U << 29;
    ptr_buffer_RAM[0] = t0;
  } else {                                              // Data message
    ptr_buffer_RAM[0] = t0;
    if (can_driver_fd_mode[x] != 0U) {                  // If FD mode
      ptr_buffer_RAM[1] = (1U << 21) | (1U << 20);      // Set FDF (FD Format) and BRS (Bit Rate Switching)
      if (size > 64U) { size = 64U; }
      for (i = 0U; i < 16U; i++) {
        if (CAN_DLC_ENCODE[i] >= size) {
          ptr_buffer_RAM[1] |= i << 16;
          break;
        }
      }
    } else {                                            // If not FD mode
      if (size > 8U) { size = 8U; }
      ptr_buffer_RAM[1] = ((uint32_t)size) << 16;
    }
    if (obj_idx < CAN_DRV_CONFIG[x].TX_FIFO_OBJ_IDX_MAX) {
      // Send using Tx FIFO
      ptr_buffer_RAM[1] |= (1U << 23);
    }

    dest32 = ptr_buffer_RAM + 2U;
    if (((uint32_t)data & 3U) == 0U) {
      // If source is 4-byte aligned copy integer number of words with
      // aligned read from source
      src32 = (const uint32_t *)data;
      for (i = 0U; i < size / 4U; i++) {
        dest32[i] = src32[i];
      }
    } else {
      // If source is not 4-byte aligned copy integer number of words with
      // unaligned read from source
      src8 = data;
      for (i = 0U; i < size / 4U; i++) {
        dest32[i] = __UNALIGNED_UINT32_READ(src8);
        src8 += 4U;
      }
    }
    if ((size & 3U) != 0U) {
      // Copy remaining up to 3 bytes (read byte by byte and write as single word)
      dest32 = ptr_buffer_RAM + 2U + ((size & 0xFFFFFFFCU) / 4U);
      src8   = data +                 (size & 0xFFFFFFFCU);
      val    = 0U;
      if ((size & 3U) > 2U) {
        val |= (uint32_t)src8[2] << 16;
      }
      if ((size & 3U) > 1U) {
        val |= (uint32_t)src8[1] << 8;
      }
      if ((size & 3U) > 0U) {
        val |= (uint32_t)src8[0];
      }
      dest32[0] = val;
    }
  }

  can_tx_obj_active[x] |= 1U << tx_obj_idx;

  ptr_CAN->TXBAR = 1U << buf_ofs_idx;

  return ((int32_t)size);
}
#if (CAN1_USED == 1)
static int32_t CAN1_MessageSend (uint32_t obj_idx, ARM_CAN_MSG_INFO *msg_info, const uint8_t *data, uint8_t size) { return CANx_MessageSend (obj_idx, msg_info, data, size, 0U); }
#endif
#if (CAN2_USED == 1)
static int32_t CAN2_MessageSend (uint32_t obj_idx, ARM_CAN_MSG_INFO *msg_info, const uint8_t *data, uint8_t size) { return CANx_MessageSend (obj_idx, msg_info, data, size, 1U); }
#endif

/**
  \fn          int32_t CANx_MessageRead (uint32_t obj_idx, ARM_CAN_MSG_INFO *msg_info, uint8_t *data, uint8_t size, uint8_t x)
  \brief       Read message received on CAN bus.
  \param[in]   obj_idx  Object index
  \param[out]  msg_info Pointer to read CAN message information
  \param[out]  data     Pointer to data buffer for read data
  \param[in]   size     Maximum number of data bytes to read
  \param[in]   x        Controller number (0..1)
  \return      value >= 0  number of data bytes read
  \return      value < 0   execution status
*/
static int32_t CANx_MessageRead (uint32_t obj_idx, ARM_CAN_MSG_INFO *msg_info, uint8_t *data, uint8_t size, uint8_t x) {
  FDCAN_GlobalTypeDef *ptr_CAN;
  uint32_t            *ptr_buffer_RAM;
  uint32_t            *src32;
  uint32_t            *dest32;
  uint8_t             *dest8;
  uint32_t             r, i, val;

  if (x >= CAN_CTRL_NUM)                                                   { return ARM_DRIVER_ERROR;           }
  if (obj_idx >= CAN_DRV_CONFIG[x].RX_TOT_OBJ_NUM)                         { return ARM_DRIVER_ERROR_PARAMETER; }
  if (can_driver_powered[x] == 0U)                                         { return ARM_DRIVER_ERROR;           }
  if ((can_obj_rx_cfg[x][obj_idx >> 5] & (1U << (obj_idx & 0x1FU))) == 0U) { return ARM_DRIVER_ERROR;           }

  ptr_CAN = ptr_regs_CANx[x];

  if (obj_idx < CAN_DRV_CONFIG[x].RX_FIFO_OBJ_IDX_MAX) {
    // Read message received with Rx FIFO
    if (obj_idx == 0U) {
      ptr_buffer_RAM = CAN_RAM_PTR[x].PTR_RX_FIFO0 + (((ptr_CAN->RXF0S & FDCAN_RXF0S_F0GI_Msk) >> FDCAN_RXF0S_F0GI_Pos) * 18U);
    } else {
      ptr_buffer_RAM = CAN_RAM_PTR[x].PTR_RX_FIFO1 + (((ptr_CAN->RXF1S & FDCAN_RXF1S_F1GI_Msk) >> FDCAN_RXF1S_F1GI_Pos) * 18U);
    }
  } else {
    // Read message received with Rx Buffer
    ptr_buffer_RAM = CAN_RAM_PTR[x].PTR_RX_BUFFER + ((obj_idx - CAN_DRV_CONFIG[x].RX_FIFO_OBJ_NUM) * 18U);
  }

  r = ptr_buffer_RAM[0];                // Read R0
  msg_info->esi = (r >> 31);            // Get Error Status Indicator flag
  if ((r & (1U << 30)) != 0U) {         // If Extended ID
    msg_info->id = ((r      ) & 0x1FFFFFFFU) | ARM_CAN_ID_IDE_Msk;
  } else {                              // If Standard ID
    msg_info->id = ((r >> 18) & 0x7FFU);
  }
  if ((r & (1U << 29)) != 0U) {         // If RTR message
    msg_info->rtr = 1U;
  } else {                              // If Data message
    msg_info->rtr = 0U;
  }
  r = ptr_buffer_RAM[1];                // Read R1
  msg_info->edl = (r >> 21) &  1U;      // Get Extended Data Length flag
  msg_info->brs = (r >> 20) &  1U;      // Get Baud Rate Switching flag
  msg_info->dlc = (r >> 16) & 15U;      // Get Data Length Code
  if (msg_info->rtr == 0U) {            // If Data message read data bytes
    if ((msg_info->edl == 1U) && (can_driver_fd_mode[x] != 0U)) {       // If FD mode and Extended Data Length bit active
      if (size > CAN_DLC_ENCODE[msg_info->dlc]) {
        size = CAN_DLC_ENCODE[msg_info->dlc];
      }
    } else {
      if (size > msg_info->dlc) {       // If not FD mode or not Extended Data Length bit active
        size = msg_info->dlc;
      }
      if (size > 8U) {
        size = 8U;
      }
    }
  } else {
    size = 0U;
  }

  if (size > 0U) {
    src32 = ptr_buffer_RAM + 2U;
    if (((uint32_t)data & 3U) == 0U) {
      // If destination is 4-byte aligned copy integer number of words with
      // aligned read from source
      dest32 = (uint32_t *)data;
      for (i = 0U; i < size / 4U; i++) {
        dest32[i] = src32[i];
      }
    } else {
      // If destination is not 4-byte aligned copy integer number of words with
      // unaligned write to destination
      dest8 = data;
      for (i = 0U; i < size / 4U; i++) {
        __UNALIGNED_UINT32_WRITE(dest8, src32[i]);
        dest8 += 4U;
      }
    }
    if ((size & 3U) != 0U) {
      // Copy remaining up to 3 bytes (read word and write byte by byte)
      src32 = ptr_buffer_RAM + 2U + ((size & 0xFFFFFFFCU) / 4U);
      dest8 = data +                 (size & 0xFFFFFFFCU);
      val   = src32[0];
      if ((size & 3U) > 0U) {
        dest8[0] = (uint8_t)(val);
      }
      if ((size & 3U) > 1U) {
        dest8[1] = (uint8_t)(val >> 8);
      }
      if ((size & 3U) > 2U) {
        dest8[2] = (uint8_t)(val >> 16);
      }
    }
  }

  if (obj_idx < CAN_DRV_CONFIG[x].RX_FIFO_OBJ_IDX_MAX) {
    // Acknowledge message received with Rx FIFO
    if (obj_idx == 0U) {
      ptr_CAN->RXF0A = (ptr_CAN->RXF0S & FDCAN_RXF0S_F0GI_Msk) >> FDCAN_RXF0S_F0GI_Pos;
    } else {
      ptr_CAN->RXF1A = (ptr_CAN->RXF1S & FDCAN_RXF1S_F1GI_Msk) >> FDCAN_RXF1S_F1GI_Pos;
    }
  } else {
    // Clear new data flag and release Rx buffer
    obj_idx -= CAN_DRV_CONFIG[x].RX_FIFO_OBJ_NUM;
    if (obj_idx < 32U) {
      ptr_CAN->NDAT1 = 1 <<  obj_idx;
    } else {
      ptr_CAN->NDAT2 = 1 << (obj_idx - 32U);
    }
  }

  return ((int32_t)size);
}
#if (CAN1_USED == 1)
static int32_t CAN1_MessageRead (uint32_t obj_idx, ARM_CAN_MSG_INFO *msg_info, uint8_t *data, uint8_t size) { return CANx_MessageRead (obj_idx, msg_info, data, size, 0U); }
#endif
#if (CAN2_USED == 1)
static int32_t CAN2_MessageRead (uint32_t obj_idx, ARM_CAN_MSG_INFO *msg_info, uint8_t *data, uint8_t size) { return CANx_MessageRead (obj_idx, msg_info, data, size, 1U); }
#endif

/**
  \fn          int32_t CANx_Control (uint32_t control, uint32_t arg, uint8_t x)
  \brief       Control CAN interface.
  \param[in]   control  Operation
                 - ARM_CAN_SET_FD_MODE :            set FD operation mode
                 - ARM_CAN_ABORT_MESSAGE_SEND :     abort sending of CAN message
                 - ARM_CAN_CONTROL_RETRANSMISSION : enable/disable automatic retransmission
                 - ARM_CAN_SET_TRANSCEIVER_DELAY :  set transceiver delay
  \param[in]   arg      Argument of operation
  \param[in]   x        Controller number (0..1)
  \return      execution status
*/
static int32_t CANx_Control (uint32_t control, uint32_t arg, uint8_t x) {
  FDCAN_GlobalTypeDef *ptr_CAN;
  uint32_t             cccr;

  if (x >= CAN_CTRL_NUM)           { return ARM_DRIVER_ERROR; }
  if (can_driver_powered[x] == 0U) { return ARM_DRIVER_ERROR; }

  ptr_CAN = ptr_regs_CANx[x];

