cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Driver/FDCAN_STM32H7xx.c
  switch (control & ARM_CAN_CONTROL_Msk) {
    case ARM_CAN_ABORT_MESSAGE_SEND:
      if ((arg < CAN_DRV_CONFIG[x].RX_TOT_OBJ_NUM) || (arg >= CAN_DRV_CONFIG[x].TOT_OBJ_NUM))     { return ARM_DRIVER_ERROR_PARAMETER; }
      if ( arg < CAN_DRV_CONFIG[x].TX_FIFO_OBJ_IDX_MAX)                                           { return ARM_DRIVER_ERROR;           }
      if ((can_obj_tx_cfg[x] & (1U << ((arg - CAN_DRV_CONFIG[x].RX_TOT_OBJ_NUM) & 0x1FU))) == 0U) { return ARM_DRIVER_OK;              }
      if (can_driver_powered[x] == 0U)                                                            { return ARM_DRIVER_ERROR;           }
      ptr_CAN->TXBCR        =  (1U << (arg - CAN_DRV_CONFIG[x].RX_TOT_OBJ_NUM - CAN_DRV_CONFIG[x].TX_FIFO_OBJ_NUM));
      can_tx_obj_active[x] &= ~(1U << (arg - CAN_DRV_CONFIG[x].RX_TOT_OBJ_NUM));
      break;
    case ARM_CAN_CONTROL_RETRANSMISSION:
      switch (arg) {
        case 0:                                 // Disable automatic retransmission
          ptr_CAN->CCCR |=  FDCAN_CCCR_DAR;
          break;
        case 1:                                 // Enable automatic retransmission
          ptr_CAN->CCCR &= ~FDCAN_CCCR_DAR;
          break;
        default:
          return ARM_DRIVER_ERROR_PARAMETER;
      }
      break;
    case ARM_CAN_SET_FD_MODE:
      cccr = ptr_CAN->CCCR;
      while ((ptr_CAN->CCCR & FDCAN_CCCR_INIT) != 0U);
      cccr |= FDCAN_CCCR_INIT;
      ptr_CAN->CCCR = cccr;
      while ((ptr_CAN->CCCR & FDCAN_CCCR_INIT) == 0U);
      cccr |= FDCAN_CCCR_CCE;
      ptr_CAN->CCCR = cccr;
      switch (arg) {
        case 0:                         // Disable FD mode
          cccr &= ~(FDCAN_CCCR_FDOE | FDCAN_CCCR_BRSE | FDCAN_CCCR_NISO);
          break;
        case 1:                         // Enable FD mode with bit rate switching
          cccr |=   FDCAN_CCCR_FDOE | FDCAN_CCCR_BRSE;
#if (CAN_NON_ISO_EN == 1U)
          cccr |=   FDCAN_CCCR_NISO;    // Enable non-ISO mode
#endif
          break;
        default:
          return ARM_DRIVER_ERROR_PARAMETER;
      }
      ptr_CAN->CCCR = cccr;
      cccr &= ~(FDCAN_CCCR_INIT | FDCAN_CCCR_CCE);
      ptr_CAN->CCCR = cccr;
      while ((ptr_CAN->CCCR & FDCAN_CCCR_INIT) == 1U);
      if (arg == 1U) {
        can_driver_fd_mode[x] = 1U;
      } else {
        can_driver_fd_mode[x] = 0U;
      }
      break;
    case ARM_CAN_SET_TRANSCEIVER_DELAY:
      switch (arg) {
        case 0:                                 // Disable transceiver delay
          ptr_CAN->DBTP |=  FDCAN_DBTP_TDC;
          break;
        case 1:                                 // Enable transceiver delay
          ptr_CAN->DBTP &= ~FDCAN_DBTP_TDC;
          break;
        default:
          return ARM_DRIVER_ERROR_PARAMETER;
      }
      break;
    default:
      return ARM_DRIVER_ERROR_UNSUPPORTED;
  }

  return ARM_DRIVER_OK;
}
#if (CAN1_USED == 1)
static int32_t CAN1_Control (uint32_t control, uint32_t arg) { return CANx_Control (control, arg, 0U); }
#endif
#if (CAN2_USED == 1)
static int32_t CAN2_Control (uint32_t control, uint32_t arg) { return CANx_Control (control, arg, 1U); }
#endif

/**
  \fn          ARM_CAN_STATUS CANx_GetStatus (uint8_t x)
  \brief       Get CAN status.
  \param[in]   x      Controller number (0..1)
  \return      CAN status ARM_CAN_STATUS
*/
static ARM_CAN_STATUS CANx_GetStatus (uint8_t x) {
           FDCAN_GlobalTypeDef *ptr_CAN;
  volatile ARM_CAN_STATUS       can_status;
           uint32_t             psr, ecr;

  if ((x >= CAN_CTRL_NUM) || (can_driver_powered[x] == 0U)) {
    *((volatile uint32_t *)&can_status) = 0U;
    return can_status;
  }

  ptr_CAN = ptr_regs_CANx[x];
  psr     = ptr_CAN->PSR;
  ecr     = ptr_CAN->ECR;

  if       ((psr & FDCAN_PSR_BO) != 0U) { can_status.unit_state = ARM_CAN_UNIT_STATE_INACTIVE; }
  else if  ((psr & FDCAN_PSR_EP) != 0U) { can_status.unit_state = ARM_CAN_UNIT_STATE_PASSIVE;  }
  else                                  { can_status.unit_state = ARM_CAN_UNIT_STATE_ACTIVE;   }

  can_status.last_error_code = CAN_LEC_ENCODE[psr & FDCAN_PSR_LEC_Msk];
  can_status.tx_error_count  = (uint8_t)(ecr & FDCAN_ECR_TEC_Msk);
  if ((ecr & FDCAN_ECR_RP) != 0U) {
    can_status.rx_error_count = 128U;
  } else {
    can_status.rx_error_count = (uint8_t)((ecr & FDCAN_ECR_REC_Msk) >> FDCAN_ECR_REC_Pos);
  }

  return can_status;
}
#if (CAN1_USED == 1)
static ARM_CAN_STATUS CAN1_GetStatus (void) { return CANx_GetStatus (0U); }
#endif
#if (CAN2_USED == 1)
static ARM_CAN_STATUS CAN2_GetStatus (void) { return CANx_GetStatus (1U); }
#endif


/**
  \fn          void CANx_Handler (void)
  \brief       CANx Interrupt Routine (IRQ).
*/
static void CANx_Handler (uint8_t x) {
  FDCAN_GlobalTypeDef *ptr_CAN;
  uint32_t             ir, psr, ndat1, ndat2, txbto, msk, obj_idx;
  volatile uint32_t    get_idx, put_idx;

  ptr_CAN = ptr_regs_CANx[x];

  ir      = ptr_CAN->IR & ptr_CAN->IE;
  ndat1   = ptr_CAN->NDAT1;
  ndat2   = ptr_CAN->NDAT2;
  txbto   = ptr_CAN->TXBTO;
  ptr_CAN->IR = ir;

  if (CAN_SignalUnitEvent[x] != NULL) {
    psr = ptr_CAN->PSR;
    if (ir & (FDCAN_IR_BO | FDCAN_IR_EP)) {             // Handle error interrupt
      if      (((ir & FDCAN_IR_BO) != 0U) && ((psr & FDCAN_PSR_BO) != 0U)) { CAN_SignalUnitEvent[x](ARM_CAN_EVENT_UNIT_BUS_OFF); }
      else if (((ir & FDCAN_IR_EP) != 0U) && ((psr & FDCAN_PSR_EP) != 0U)) { CAN_SignalUnitEvent[x](ARM_CAN_EVENT_UNIT_PASSIVE); }
      else                                                                 { CAN_SignalUnitEvent[x](ARM_CAN_EVENT_UNIT_ACTIVE);  }
    }
    if (((ir & FDCAN_IR_EW) != 0U) && ((psr & FDCAN_PSR_EW) != 0U))        { CAN_SignalUnitEvent[x](ARM_CAN_EVENT_UNIT_WARNING); }
  }

  if (CAN_SignalObjectEvent[x] != NULL) {
                                                        // Handle transmit events
    if (ir & FDCAN_IR_TEFN) {                           // If message was transmitted using Tx FIFO
      get_idx = (ptr_CAN->TXEFS & FDCAN_TXEFS_EFGI_Msk) >> FDCAN_TXEFS_EFGI_Pos;
      put_idx = (ptr_CAN->TXEFS & FDCAN_TXEFS_EFPI_Msk) >> FDCAN_TXEFS_EFPI_Pos;
      do {
        ptr_CAN->TXEFA = get_idx;
        CAN_SignalObjectEvent[x](CAN_DRV_CONFIG[x].RX_TOT_OBJ_NUM, ARM_CAN_EVENT_SEND_COMPLETE);
        get_idx = (ptr_CAN->TXEFS & FDCAN_TXEFS_EFGI_Msk) >> FDCAN_TXEFS_EFGI_Pos;
        put_idx = (ptr_CAN->TXEFS & FDCAN_TXEFS_EFPI_Msk) >> FDCAN_TXEFS_EFPI_Pos;
      } while (get_idx != put_idx);
    }
    if (ir & FDCAN_IR_TC) {                             // If message was transmitted using dedicated Tx buffer
      for (obj_idx = 0U, msk = 1U; (txbto != 0U) || (msk != 0U); obj_idx++, msk <<= 1U) {
        if ((txbto & msk) != 0U) {
          txbto &= ~msk;
          CAN_SignalObjectEvent[x](obj_idx + CAN_DRV_CONFIG[x].RX_TOT_OBJ_NUM, ARM_CAN_EVENT_SEND_COMPLETE);
        }
      }
    }

