cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Driver/FDCAN_STM32H7xx.c
                                                        // Handle receive events
    if (ir & FDCAN_IR_RF0N) {                           // If message was received to Rx FIFO0
      CAN_SignalObjectEvent[x](0U, ARM_CAN_EVENT_RECEIVE);
    }
    if (ir & FDCAN_IR_RF1N) {                           // If message was received to Rx FIFO1
      CAN_SignalObjectEvent[x](1U, ARM_CAN_EVENT_RECEIVE);
    }
    if (ir & FDCAN_IR_DRX) {                            // If message was received to dedicated Rx buffer
      if ((ndat1 | ndat2) != 0U) {
        for (obj_idx = 0U, msk = 1U; (ndat1 != 0U) && (msk != 0U); obj_idx++, msk <<= 1U) {
          if ((ndat1 & msk) != 0U) {
            ndat1 &= ~msk;
            CAN_SignalObjectEvent[x](obj_idx + CAN_DRV_CONFIG[x].RX_FIFO_OBJ_NUM, ARM_CAN_EVENT_RECEIVE);
          }
        }
        if (CAN_DRV_CONFIG[x].RX_TOT_OBJ_NUM > 32U) {
          for (obj_idx = 32U, msk = 1U; (ndat2 != 0U) && (msk != 0U); obj_idx++, msk <<= 1U) {
            if ((ndat2 & msk) != 0U) {
              ndat2 &= ~msk;
              CAN_SignalObjectEvent[x](obj_idx + CAN_DRV_CONFIG[x].RX_FIFO_OBJ_NUM, ARM_CAN_EVENT_RECEIVE);
            }
          }
        }
      }
    }
  }
}

/**
  \fn          void MCAN1_Handler (void)
  \brief       CAN1 Interrupt Routine (IRQ).
*/
#if (CAN1_USED == 1)
void FDCAN1_IT0_IRQHandler (void) { CANx_Handler (0); }
#endif

/**
  \fn          void MCAN2_Handler (void)
  \brief       CAN2 Interrupt Routine (IRQ).
*/
#if (CAN2_USED == 1)
void FDCAN2_IT0_IRQHandler (void) { CANx_Handler (1); }
#endif


#if (CAN1_USED == 1)
ARM_DRIVER_CAN Driver_CAN1 = {
  CAN_GetVersion,
  CAN1_GetCapabilities,
  CAN1_Initialize,
  CAN1_Uninitialize,
  CAN1_PowerControl,
  CAN_GetClock,
  CAN1_SetBitrate,
  CAN1_SetMode,
  CAN1_ObjectGetCapabilities,
  CAN1_ObjectSetFilter,
  CAN1_ObjectConfigure,
  CAN1_MessageSend,
  CAN1_MessageRead,
  CAN1_Control,
  CAN1_GetStatus
};
#endif

#if (CAN2_USED == 1)
ARM_DRIVER_CAN Driver_CAN2 = {
  CAN_GetVersion,
  CAN2_GetCapabilities,
  CAN2_Initialize,
  CAN2_Uninitialize,
  CAN2_PowerControl,
  CAN_GetClock,
  CAN2_SetBitrate,
  CAN2_SetMode,
  CAN2_ObjectGetCapabilities,
  CAN2_ObjectSetFilter,
  CAN2_ObjectConfigure,
  CAN2_MessageSend,
  CAN2_MessageRead,
  CAN2_Control,
  CAN2_GetStatus
};
#endif

/*! \endcond */
